-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: i8a301.p.ssafy.io    Database: sccs
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `studyroom`
--

DROP TABLE IF EXISTS `studyroom`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `studyroom` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(50) NOT NULL,
  `password` varchar(10) DEFAULT NULL,
  `create_datetime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `destroy_datetime` timestamp NULL DEFAULT NULL,
  `is_active` tinyint NOT NULL DEFAULT '1',
  `is_solving` tinyint NOT NULL DEFAULT '0',
  `is_private` tinyint NOT NULL DEFAULT '0',
  `host_id` varchar(45) NOT NULL,
  `personnel` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `studyroom`
--

LOCK TABLES `studyroom` WRITE;
/*!40000 ALTER TABLE `studyroom` DISABLE KEYS */;
INSERT INTO `studyroom` VALUES (1,'같이 공부해~~','1111','2023-02-16 03:43:17','2023-02-16 03:43:51',1,1,1,'qkr2713',1),(2,'삼성 가즈아','','2023-02-16 03:47:21','2023-02-16 04:18:36',1,1,0,'chan123',5),(3,'난 코테왕이 될꺼야~~!!','','2023-02-16 04:00:27','2023-02-16 04:07:59',1,0,0,'moa2029',5),(4,'이번에는 반드시 뽀갠다','','2023-02-16 04:08:12','2023-02-16 04:39:51',1,0,0,'moa2029',2),(5,'코딩 체험 스터디!','','2023-02-16 05:02:35','2023-02-16 05:05:25',1,1,0,'moa2029',1),(6,'실전코테','','2023-02-16 05:05:38','2023-02-16 05:12:21',1,1,0,'moa2029',5),(7,'삼성 취준','','2023-02-16 05:12:18',NULL,1,0,0,'chan123',5),(8,'커피내기','1111','2023-02-16 05:12:31','2023-02-16 05:13:52',1,0,1,'calicedev',1),(9,'스터디원 구해요~','','2023-02-16 05:12:57','2023-02-16 05:14:50',1,1,0,'moa2029',3),(10,'8기 서울 12반 ','1111','2023-02-16 05:15:05','2023-02-16 05:15:25',1,1,1,'calicedev',1),(11,'회식내기','','2023-02-16 05:36:11','2023-02-16 05:52:17',0,0,0,'chan123',3),(12,'다 드루와','','2023-02-16 05:37:36','2023-02-16 05:39:06',0,1,0,'chan123',1),(13,'진사람이치킨','','2023-02-16 07:14:45',NULL,1,1,0,'ssafy08',1),(14,'손균탁만 들어와','','2023-02-16 07:16:59','2023-02-16 07:19:06',1,1,0,'ssafy08',1),(15,'균탁이형 들어와','1111','2023-02-16 07:41:33','2023-02-16 07:49:56',0,0,1,'moa2029',5),(16,'균탁이형 다시 드러와~~~','','2023-02-16 07:50:08','2023-02-16 07:55:46',0,1,0,'moa2029',1),(17,'균탁형 몇번 들어오는걸까','1111','2023-02-16 07:59:50','2023-02-16 08:04:39',0,1,1,'qkr2713',1),(18,'민트초코좋아하는사람','1234','2023-02-16 08:02:04','2023-02-16 08:02:47',0,0,1,'ssafy08',1),(19,'카페모카내기','1111','2023-02-16 08:03:08','2023-02-16 08:03:41',0,0,1,'ssafy08',1),(21,'컨설턴트님 제가 1등 맞죠???','5678','2023-02-16 08:33:55',NULL,1,0,1,'moa2029',2),(22,'한놈만 팬다..','','2023-02-16 08:45:33',NULL,1,0,0,'chan123',2),(23,'테스트 합니다','1111','2023-02-16 10:25:17',NULL,1,0,1,'moa2029',0),(24,'테스트 중','1234','2023-02-16 10:47:18','2023-02-16 10:48:41',0,0,1,'moa2029',1),(25,'2문제 다 맞춘다','2134','2023-02-16 12:16:05','2023-02-16 12:17:13',0,0,1,'chan123',1),(26,'기초 실력 키우기','1289','2023-02-16 12:17:46','2023-02-16 12:18:45',0,0,1,'chan123',2),(27,'1팀 모두 모여!!!','5678','2023-02-16 13:22:37','2023-02-16 13:34:15',0,0,1,'moa2029',1),(28,'1팀 다시모여','','2023-02-16 13:36:56',NULL,1,0,0,'moa2029',0),(29,'asdfasdf','','2023-02-16 13:37:07',NULL,1,0,0,'asdf1234',0),(30,'하이루','','2023-02-16 13:40:41','2023-02-16 13:42:30',0,0,0,'moa2029',2),(31,'제곧내','','2023-02-16 13:42:46','2023-02-16 13:50:08',0,1,0,'moa2029',1),(32,'테스트 하는 중~~','','2023-02-16 14:05:05','2023-02-16 14:08:55',0,1,0,'moa2029',1),(33,'다시 시작하는거야','5678','2023-02-16 14:09:40','2023-02-16 14:15:38',0,1,1,'moa2029',2),(34,'하이루','','2023-02-16 14:19:32',NULL,1,1,0,'moa2029',1),(35,'이제 진짜.... 뽀개버리자','','2023-02-16 14:29:56','2023-02-16 14:53:55',0,1,0,'moa2029',3),(36,'sdfsd','','2023-02-16 14:54:14','2023-02-16 14:54:54',0,1,0,'moa2029',1),(37,'치킨 내기 고?','','2023-02-16 14:55:27','2023-02-16 14:58:34',0,1,0,'moa2029',2),(38,'오늘 안에 끝낼 수 있음??','','2023-02-16 15:03:29','2023-02-16 15:08:11',0,1,0,'moa2029',2),(39,'내일은 끝낼 수 있음?','','2023-02-16 15:08:35','2023-02-16 15:10:37',0,1,0,'moa2029',1),(40,'진짜 제발','','2023-02-16 15:15:02','2023-02-16 15:20:28',0,1,0,'moa2029',1),(41,'하하호호 즐거운 오늘하루','','2023-02-16 15:22:11','2023-02-16 15:29:11',0,1,0,'moa2029',2),(42,'코치님 저희가 1등이죠???','5678','2023-02-16 15:38:11','2023-02-16 15:43:32',0,1,1,'moa2029',1),(43,'파이썬 너만 오면 고!','','2023-02-16 16:24:25',NULL,1,1,0,'showmaker',0),(44,'자이제시작이야','','2023-02-16 16:26:31','2023-02-16 16:28:36',0,1,0,'calicedev',1),(45,'취업 성공하자','','2023-02-17 00:10:26','2023-02-17 00:12:02',0,0,0,'calicedev',2),(46,'더 코테','','2023-02-17 00:12:26','2023-02-17 00:22:10',0,1,0,'calicedev',1),(47,'더 코테~~~~~~','','2023-02-17 00:22:26','2023-02-17 00:30:17',0,1,0,'moa2029',2),(48,'실코체스','1234','2023-02-17 00:30:48','2023-02-17 00:31:44',0,0,1,'chan123',1),(49,'내 꿈은 너','','2023-02-17 01:23:45','2023-02-17 01:26:24',0,0,0,'moa2029',2),(50,'ㅇ','','2023-02-17 01:26:29','2023-02-17 01:29:20',0,1,0,'moa2029',1);
/*!40000 ALTER TABLE `studyroom` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-17 10:33:53
