-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: i8a301.p.ssafy.io    Database: sccs
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `problem`
--

DROP TABLE IF EXISTS `problem`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `problem` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `difficulty` int NOT NULL,
  `problem_folder` varchar(1000) DEFAULT NULL,
  `memory_limit` int DEFAULT NULL,
  `time_limit` int DEFAULT NULL,
  `submission_number` int DEFAULT '0',
  `accepted_number` int DEFAULT '0',
  `algo_id` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=87 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `problem`
--

LOCK TABLES `problem` WRITE;
/*!40000 ALTER TABLE `problem` DISABLE KEYS */;
INSERT INTO `problem` VALUES (1,'k번째 약수',1,'1-1',256,2,24,4,1),(2,'k번째 수',1,'1-2',256,2,62,6,1),(3,'k번째 큰 수',1,'1-3',256,2,47,8,1),(4,'대표값',1,'1-4',256,2,24,7,1),(5,'정다면체',1,'1-5',256,2,44,4,1),(6,'자릿수의 합',1,'1-6',256,2,61,10,1),(7,'소수(에라토스테네스 체)',1,'1-7',256,2,44,1,1),(8,'뒤집은 소수',1,'1-8',256,2,73,2,1),(9,'주사위 게임',1,'1-9',256,2,25,2,1),(10,'점수 계산',1,'1-10',256,2,56,7,1),(11,'회문 문자열 검사',1,'2-1',256,2,9,1,2),(12,'숫자만 추출',1,'2-2',256,2,4,2,2),(13,'카드 역배치',1,'2-3',256,2,13,1,2),(14,'두 리스트 합치기',1,'2-4',256,2,7,1,2),(15,'수들의 합',2,'2-5',256,2,4,2,2),(16,'격자판 최대합',2,'2-6',256,2,28,14,2),(17,'사과나무',2,'2-7',256,2,3,1,2),(18,'곶감',2,'2-8',256,2,2,2,2),(19,'봉우리',2,'2-9',256,2,3,0,2),(20,'스도쿠 검사',3,'2-10',256,2,4,0,2),(21,'격자문 회문수',3,'2-11',256,2,2,0,2),(22,'이분검색',2,'3-1',256,2,6,0,3),(23,'랜선자르기',2,'3-2',256,2,3,0,3),(24,'뮤직비디오',2,'3-3',256,2,0,0,3),(25,'마구간 정하기',2,'3-4',256,2,0,0,3),(26,'회의실 배정',2,'3-5',256,2,4,0,3),(27,'씨름선수',2,'3-6',256,2,0,0,3),(28,'창고 정리',2,'3-7',256,2,0,0,3),(29,'침몰하는 타이타닉',2,'3-8',256,2,0,0,3),(30,'증가수열 만들기',2,'3-9',256,2,6,0,3),(31,'역수열',2,'3-10',256,2,1,0,3),(32,'가장 큰 수',2,'4-1',256,2,3,0,4),(33,'쇠막대기',2,'4-2',256,2,3,0,4),(34,'후위표기식 만들기',2,'4-3',256,2,1,0,4),(35,'후위식 연산',2,'4-4',256,2,0,0,4),(36,'공주 구하기',3,'4-5',256,2,0,0,4),(37,'응급실',3,'4-6',256,2,2,0,4),(38,'교육과정 설계',3,'4-7',256,2,1,0,4),(39,'단어찾기',3,'4-8',256,2,3,0,4),(40,'아나그램',3,'4-9',256,2,2,0,4),(41,'최소힙',3,'4-10',256,2,2,0,4),(42,'최대힙',3,'4-11',256,2,1,0,4),(43,'재귀함수란',3,'5-1',256,2,1,0,5),(44,'부분집합 구하기',2,'5-2',256,2,3,0,5),(45,'합이 같은 부분집합',2,'5-3',256,2,4,0,5),(46,'바둑이 승자',2,'5-4',256,2,0,0,5),(47,'중복 순열 구하기',2,'5-5',256,2,2,0,5),(48,'동전교환',2,'5-6',256,2,0,0,5),(49,'순열 구하기',2,'5-7',256,2,2,0,5),(50,'수열 추측하기',3,'5-8',256,2,1,0,5),(51,'조합 구하기',3,'5-9',256,2,0,0,5),(52,'수들의 조합',3,'5-10',256,2,1,0,5),(53,'경로 탐색',3,'5-11',256,2,0,0,5),(54,'최대점수 구하기',3,'6-1',256,2,0,0,6),(55,'휴가',3,'6-2',256,2,0,0,6),(56,'양팔저울',3,'6-3',256,2,0,0,6),(57,'동전 바꿔주기',3,'6-4',256,2,0,0,6),(58,'동전 분배하기',3,'6-5',256,2,0,0,6),(59,'알파코드',3,'6-6',256,2,0,0,6),(60,'송아지 찾기',3,'6-7',256,2,0,0,6),(61,'사과나무',3,'6-8',256,2,0,0,6),(62,'미로의 최단거리 통로',3,'6-9',256,2,0,0,6),(63,'미로탐색',3,'6-10',256,2,0,0,6),(64,'등산경로',3,'6-11',256,2,2,0,6),(65,'단지번호붙이기',3,'6-12',256,2,0,0,6),(66,'섬나라 아일랜드',3,'6-13',256,2,2,0,6),(67,'안전 영역',3,'6-14',256,2,0,0,6),(68,'토마토',3,'6-15',256,2,1,0,6),(69,'사다리 타기',3,'6-16',256,2,1,0,6),(70,'피자 배달 거리',3,'6-17',256,2,0,0,6),(73,'네트워크 선 자르기',3,'7-1',256,2,1,0,7),(74,'네트워크 선 자르기 DP',3,'7-2',256,2,0,0,7),(75,'최대부분증가수열',3,'7-3',256,2,0,0,7),(76,'최대 선 연결하기',3,'7-4',256,2,0,0,7),(77,'가장 높은 탑 쌓기(LIS 응용)',3,'7-5',256,2,0,0,7),(78,'알리바바와 40인의 도둑 BT',3,'7-6',256,2,0,0,7),(79,'알리바바와 40인의 도둑 TB',3,'7-7',256,2,1,0,7),(80,'가방문제',3,'7-8',256,2,0,0,7),(81,'동전교환',3,'7-9',256,2,0,0,7),(82,'최대 점수 구하기',3,'7-10',256,2,0,0,7),(83,'플로이드 워샬 알고리즘',3,'7-11',256,2,2,0,7),(84,'회장 뽑기',3,'7-12',256,2,1,0,7);
/*!40000 ALTER TABLE `problem` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-17 10:33:54
